DingDa-H/stm32f1_rtos/User/Device/ring_buffer_device.c
/**
 * @brief 		串口收发优化，环形缓冲区的实现
 * @param 		
 * @data 		20260611
 * @note 		不是自己想出来的，我只是知道有这个东西，不过我要自己独立实现
 */
#include "stm32f1xx_hal.h"
#include "string.h"
#include "ring_buffer_device.h"


static stRingBufTdf s_stRingBuf[RING_BUFFER_DEV_NUM];

/// @brief      环形缓冲区参数初始化
///
/// @note
void vRingBufParamCopy(stRingBufTdf *pststaticInit,emRingBufNumTdf emDevNum)
{
	if(NULL == pststaticInit)
	{
		return;
	}
	memcpy(&s_stRingBuf[emDevNum],pststaticInit,sizeof(stRingBufTdf)/sizeof(uint8_t));
}
/**
 * @brief 		写入一个字节
 * @param 	
 * @rev 		0-成功	1-失败
 * @note 		向缓冲区写入字节
 */
uint8_t ucWriteOnebyte(uint8_t byte,emRingBufNumTdf emDevNum)
{
	if(s_stRingBuf[emDevNum].ucCount >= RX_BUF_SIZE)
	{
		return 1;
	}
	
	s_stRingBuf[emDevNum].aucBuf[s_stRingBuf[emDevNum].ucWrite ++] = byte;
	if(s_stRingBuf[emDevNum].ucWrite >= RX_BUF_SIZE)
	{
		s_stRingBuf[emDevNum].ucWrite = 0;
	}
	s_stRingBuf[emDevNum].ucCount++;
	return 0;
}

/**
 * @brief 		读取一个字节
 * @param 		pucByte：缓冲区数组地址
 * @rev 		0-成功	1-失败
 * @note 		从缓冲区读取字节
 */
uint8_t ucReadOnebyte(uint8_t *pucByte,emRingBufNumTdf emDevNum)
{
	if (s_stRingBuf[emDevNum].ucCount == 0)   // 空，无数据可读
    return 1;

	*pucByte = s_stRingBuf[emDevNum].aucBuf[s_stRingBuf[emDevNum].ucRead ++];
	if (s_stRingBuf[emDevNum].ucRead >= RX_BUF_SIZE) 
	{
		s_stRingBuf[emDevNum].ucRead = 0;
	}
	s_stRingBuf[emDevNum].ucCount--;
	return 0;
}
/**
 * @brief 		缓冲区清空函数
 * @param 		aucRxBuf：缓冲区数组
 * @note 		从缓冲区读取字节
 */
void vRingBufClear(uint8_t ucDevNum)
{
    if (ucDevNum >= RING_BUFFER_DEV_NUM) return;
    s_stRingBuf[ucDevNum].ucRead  = 0;
    s_stRingBuf[ucDevNum].ucWrite = 0;
    s_stRingBuf[ucDevNum].ucCount = 0;
}